import { MockData } from "./types";

export const data: MockData = {
  timeIntervals: [
    {
      id: "uid-0",
      name: "Просвещение",
      start: 1700,
      end: 1800,
      events: [
        {
          id: "uid-0-1",
          year: 1751,
          description:
            "Публикация первой Энциклопедии Дидро и Д'Аламбера, символа научных знаний и идей свободы.",
        },
        {
          id: "uid-0-2",
          year: 1789,
          description:
            "Начало Великой французской революции, положившей основу современному демократическому обществу.",
        },
        {
          id: "uid-0-3",
          year: 1776,
          description:
            "Принятие Декларации независимости США, важный шаг в становлении новой нации.",
        },
        {
          id: "uid-0-4",
          year: 1791,
          description:
            "Публикация Энциклопедии законов, заложившей основы современных юридических систем.",
        },
        {
          id: "uid-0-5",
          year: 1799,
          description:
            "Начало консульства Наполеона, приведшее к преобразованию Франции.",
        },
      ],
    },
    {
      id: "uid-00",
      name: "Индустриализация",
      start: 1800,
      end: 1900,
      events: [
        {
          id: "uid-00-1",
          year: 1825,
          description:
            "Открытие первой железной дороги в Англии, ускорившей модернизацию и торговлю.",
        },
        {
          id: "uid-00-2",
          year: 1876,
          description:
            "Изобретение телефона Беллом, открывшего новую эру в коммуникациях.",
        },
        {
          id: "uid-00-3",
          year: 1837,
          description:
            "Создание первого телеграфа Морзе, ускорившего передачу информации.",
        },
        {
          id: "uid-00-4",
          year: 1851,
          description:
            "Первая Всемирная выставка в Лондоне, демонстрировавшая достижения промышленности.",
        },
        {
          id: "uid-00-5",
          year: 1893,
          description:
            "Изобретение двигателя внутреннего сгорания, ключевого для автомобильной индустрии.",
        },
      ],
    },
    {
      id: "uid-2",
      name: "Кино",
      start: 1920,
      end: 1940,
      events: [
        {
          id: "uid-2-1",
          year: 1927,
          description:
            "Премьера первого звукового фильма, изменившего киноиндустрию.",
        },
        {
          id: "uid-2-2",
          year: 1933,
          description:
            "Выход Кинг Конга, основоположника приключенческого жанра.",
        },
        {
          id: "uid-2-3",
          year: 1939,
          description:
            "Премьера Унесенных ветром и Волшебника страны Оз, классики мирового кино.",
        },
        {
          id: "uid-2-4",
          year: 1940,
          description:
            "Первое использование CGI, открывшее новые горизонты визуального повествования.",
        },
        {
          id: "uid-2-5",
          year: 1931,
          description:
            "Выход первого полнометражного анимационного фильма Диснея.",
        },
      ],
    },
    {
      id: "uid-3",
      name: "Наука",
      start: 1940,
      end: 1960,
      events: [
        {
          id: "uid-3-1",
          year: 1945,
          description:
            "Создание первого ядерного реактора, ключевого для атомной энергетики.",
        },
        {
          id: "uid-3-2",
          year: 1953,
          description:
            "Открытие структуры ДНК, революционизировавшее молекулярную биологию.",
        },
        {
          id: "uid-3-3",
          year: 1957,
          description:
            "Запуск Спутника-1, начавший эру космических исследований.",
        },
        {
          id: "uid-3-4",
          year: 1960,
          description:
            "Создание первого лазера, применяемого в медицине и науке.",
        },
        {
          id: "uid-3-5",
          year: 1947,
          description:
            "Изобретение транзистора, основного для современной электроники.",
        },
      ],
    },
    {
      id: "uid-4",
      name: "Технологии",
      start: 1960,
      end: 1980,
      events: [
        {
          id: "uid-4-1",
          year: 1969,
          description:
            "Высадка на Луну в рамках миссии Аполлон-11, символ технологического прогресса.",
        },
        {
          id: "uid-4-2",
          year: 1973,
          description:
            "Создание первого мобильного телефона Motorola, изменившего способы общения.",
        },
        {
          id: "uid-4-3",
          year: 1975,
          description:
            "Основание Microsoft, начавшее эру персональных компьютеров.",
        },
        {
          id: "uid-4-4",
          year: 1980,
          description:
            "Запуск IBM PC, сделавшего компьютеры доступными для широкой аудитории.",
        },
        {
          id: "uid-4-5",
          year: 1977,
          description:
            "Запуск коммерческих спутников связи, основа глобальных телекоммуникаций.",
        },
      ],
    },
    {
      id: "uid-6",
      name: "Музыка",
      start: 2000,
      end: 2020,
      events: [
        {
          id: "uid-6-1",
          year: 2003,
          description:
            "Выход iTunes, революционизировавшего музыкальную индустрию.",
        },
        {
          id: "uid-6-2",
          year: 2015,
          description: "Хит Hello Адель, укрепивший её статус мировой звезды.",
        },
        {
          id: "uid-6-3",
          year: 2020,
          description:
            "Онлайн-концерты во время COVID-19, адаптация индустрии.",
        },
        {
          id: "uid-6-4",
          year: 2008,
          description:
            "Альбом Viva La Vida Coldplay, международный хит с наградами.",
        },
        {
          id: "uid-6-5",
          year: 2010,
          description:
            "Создание Spotify, изменившего способ прослушивания музыки.",
        },
      ],
    },
  ],
};
