import { MockData } from "./types";

export const data: MockData = {
  timeIntervals: [
    {
      id: "uid-1",
      name: "Литература",
      start: 1900,
      end: 1920,
      events: [
        {
          id: "uid-1-1",
          year: 1903,
          description: "Основание Нобелевской премии по литературе.",
        },
        {
          id: "uid-1-2",
          year: 1905,
          description: "Публикация романа Крестный отец Джеймса Джойса.",
        },
        {
          id: "uid-1-3",
          year: 1911,
          description: "Публикация произведения Франца Кафки Превращение.",
        },
        {
          id: "uid-1-4",
          year: 1920,
          description:
            "Завершение Войны и мира Льва Толстого в виде адаптации.",
        },
      ],
    },
    {
      id: "uid-2",
      name: "Кино",
      start: 1920,
      end: 1940,
      events: [
        {
          id: "uid-2-1",
          year: 1927,
          description: "Премьера первого звукового фильма Певец джаза.",
        },
        {
          id: "uid-2-2",
          year: 1933,
          description: "Выход фильма Кинг Конг, ставшего культовым.",
        },
        {
          id: "uid-2-3",
          year: 1939,
          description: "Премьера Унесенных ветром и Волшебника страны Оз.",
        },
        {
          id: "uid-2-4",
          year: 1940,
          description: "Первое использование спецэффектов CGI в кинематографе.",
        },
      ],
    },
    {
      id: "uid-3",
      name: "Наука",
      start: 1940,
      end: 1960,
      events: [
        {
          id: "uid-3-1",
          year: 1945,
          description: "Создание первого ядерного реактора.",
        },
        {
          id: "uid-3-2",
          year: 1953,
          description: "Открытие структуры ДНК Уотсоном и Криком.",
        },
        {
          id: "uid-3-3",
          year: 1957,
          description:
            "Запуск первого искусственного спутника Земли, Спутник-1.",
        },
        {
          id: "uid-3-4",
          year: 1960,
          description: "Создание первого лазера.",
        },
      ],
    },
    {
      id: "uid-4",
      name: "Технологии",
      start: 1960,
      end: 1980,
      events: [
        {
          id: "uid-4-1",
          year: 1969,
          description:
            "Успешная высадка человека на Луну в рамках миссии Аполлон-11.",
        },
        {
          id: "uid-4-2",
          year: 1973,
          description:
            "Создание первого мобильного телефона компании Motorola.",
        },
        {
          id: "uid-4-3",
          year: 1975,
          description:
            "Основание компании Microsoft Биллом Гейтсом и Полом Алленом.",
        },
        {
          id: "uid-4-4",
          year: 1980,
          description:
            "Выход на рынок первой персональной компьютерной системы IBM PC.",
        },
      ],
    },
    {
      id: "uid-5",
      name: "Спорт",
      start: 1980,
      end: 2000,
      events: [
        {
          id: "uid-5-1",
          year: 1984,
          description: "Дебют Майкла Джордана в НБА.",
        },
        {
          id: "uid-5-2",
          year: 1992,
          description:
            "Олимпиада в Барселоне: впервые после холодной войны объединенные команды.",
        },
        {
          id: "uid-5-3",
          year: 1998,
          description: "Победа Франции на чемпионате мира по футболу.",
        },
        {
          id: "uid-5-4",
          year: 2000,
          description:
            "Олимпиада в Сиднее: рекордное количество стран-участниц.",
        },
      ],
    },
    {
      id: "uid-6",
      name: "Музыка",
      start: 2000,
      end: 2020,
      events: [
        {
          id: "uid-6-1",
          year: 2003,
          description: "Выход iTunes, революция в музыкальной индустрии.",
        },
        {
          id: "uid-6-2",
          year: 2015,
          description: "Выход хита Hello Адель, ставшего мировым феноменом.",
        },
        {
          id: "uid-6-3",
          year: 2020,
          description: "Организация онлайн-концертов из-за пандемии COVID-19.",
        },
      ],
    },
  ],
};
